SoftwareEnthusiastArjun/ESP32_Based_FlightStabilizer/ESP32_FlightStabilizer_Firmware/src/main.cpp
// ================================================================
//         ESP32 FLIGHT STABILIZER FIRMWARE — FINAL VERSION
//         Dual-core: Core 1 = flight control, Core 0 = WiFi/GCS
// ================================================================

#include <Wire.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiServer.h>
#include <ESPmDNS.h>
#include <EEPROM.h>
#include <ESP32Servo.h>
#include <math.h>
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"

// ================================================================
//                        EEPROM LAYOUT
//  addr  0 : ACCEL_FILTER  (float, 4 bytes)
//  addr  4 : GYRO_FILTER   (float, 4 bytes)
//  addr  8 : COMP_FILTER   (float, 4 bytes)
//  addr 12 : pitchPID.Kp   (float, 4 bytes)
//  addr 16 : pitchPID.Ki   (float, 4 bytes)
//  addr 20 : pitchPID.Kd   (float, 4 bytes)
//  addr 24 : rollPID.Kp    (float, 4 bytes)
//  addr 28 : rollPID.Ki    (float, 4 bytes)
//  addr 32 : rollPID.Kd    (float, 4 bytes)
//  addr 36 : axisConfig    (uint8, 1 byte)  bit0=swap, bit1=pitchSign, bit2=rollSign
//  addr 37 : pidDeadband   (float, 4 bytes)
//  addr 41 : servoDeadband (float, 4 bytes)
//  --- WiFi credentials (new) ---
//  addr 45 : wifi_valid    (uint8, 1 byte)  0xA5 = valid credentials stored
//  addr 46 : wifi_ssid     (char[64])       null-terminated SSID
//  addr 110 : wifi_pass    (char[64])       null-terminated password
//  TOTAL: 174 bytes
// ================================================================
#define EEPROM_SIZE         176
#define ACCEL_FILTER_ADDR    0
#define GYRO_FILTER_ADDR     4
#define COMP_FILTER_ADDR     8
#define PITCH_PID_ADDR      12
#define ROLL_PID_ADDR       24
#define AXIS_CONFIG_ADDR    36
#define PID_DB_ADDR         37
#define SERVO_DB_ADDR       41
// WiFi credential addresses
#define WIFI_VALID_ADDR     45
#define WIFI_SSID_ADDR      46
#define WIFI_PASS_ADDR      110
#define WIFI_FIELD_LEN      64
#define WIFI_VALID_MAGIC    0xA5

#ifndef M_PI
  #define M_PI 3.14159265358979323846
#endif

// ================================================================
//                     MPU6050 CONFIGURATION
// gSensitivity must match register 0x1B:
//   0x00 = ±250°/s  → 131.0
//   0x08 = ±500°/s  → 65.5  ← current
//   0x10 = ±1000°/s → 32.8
//   0x18 = ±2000°/s → 16.4
// ================================================================
#define MPU6050_ADDR  0x68
const float  FREQ          = 50.0f;   // Hz — control loop AND sensor rate
const double G_SENSITIVITY = 65.5;    // must match 0x1B

// ================================================================
//                       HARDWARE PINS
// ================================================================
#define PITCH_IP         15   // PWM input: pitch stick
#define ROLL_IP          16   // PWM input: roll stick
#define YAW_IP           17   // PWM input: yaw stick (read, not yet used)
#define AUTO_PILOT_IP    18   // PWM input: mode switch (>90% = auto)
#define PITCH_SERVO_PIN  25
#define ROLL_SERVO_PIN   26
#define LED_PIN           2

#define MIN_PW       999    // µs — minimum valid PWM pulse
#define MAX_PW      1993    // µs — maximum valid PWM pulse
#define PW_TIMEOUT  25000   // µs — pulseIn timeout (kept for reference; no longer used)

// ── PWM INPUT — interrupt-driven capture (replaces blocking pulseIn) ──
// Each channel has an ISR on CHANGE that records rising-edge time and
// computes pulse width on the falling edge. All shared state is 32-bit
// aligned → atomic on Xtensa LX6, no critical sections needed (same
// convention as pwmPct1..pwmPct4 below). If no edge has been seen for
// SIGNAL_TIMEOUT_US the channel is reported as 0 µs in loop(), exactly
// matching the old pulseIn timeout behavior — so "No signal" handling
// downstream (p4 == 0 → autopilot off, GCS shows "No signal") is unchanged.
#define SIGNAL_TIMEOUT_US 30000UL   // 30 ms — 1.5× RC frame, replicates pulseIn(25 ms)
static const uint8_t PWM_PINS[4] = { PITCH_IP, ROLL_IP, YAW_IP, AUTO_PILOT_IP };
volatile uint32_t pulseRise[4]  = {0, 0, 0, 0};   // ISR-only: last rising-edge timestamp
volatile uint32_t pulseWidth[4] = {0, 0, 0, 0};   // ISR → loop: last measured pulse width
volatile uint32_t lastEdge[4]   = {0, 0, 0, 0};   // ISR → loop: last edge timestamp (for staleness)

#define SERVO_MIN    45
#define SERVO_MAX   135
#define SERVO_CENTER 90

// ================================================================
//                       WIFI / TCP
// ================================================================
// Default (fallback) credentials — used only if no credentials are
// stored in EEPROM. The user-supplied credentials always take priority.
#define DEFAULT_WIFI_SSID "aju"
#define DEFAULT_WIFI_PASS "@ajujcd@"

// Runtime WiFi credential buffers — loaded from EEPROM or set to defaults
static char wifiSSID[WIFI_FIELD_LEN] = DEFAULT_WIFI_SSID;
static char wifiPass[WIFI_FIELD_LEN] = DEFAULT_WIFI_PASS;

WiFiServer   tcpServer(12345);
#define MAX_CMD_LEN  48

// ================================================================
//                  RUNTIME TUNABLE PARAMETERS
//  All of these can be changed live from GCS and saved to EEPROM.
// ================================================================

// Filter coefficients
float ACCEL_FILTER = 0.3f;
float GYRO_FILTER  = 0.08f;
float COMP_FILTER  = 0.02f; // complementary filter: 0 = gyro-only, 1 = accel-only. now .98 gyro, .02 accel

// PID deadband: errors smaller than this (degrees) are treated as zero.
// Prevents servo hunting from sensor noise at rest.
float PID_DEADBAND   = 0.8f;

// Servo deadband: only command servo if angle change ≥ this (degrees).
// Prevents micro-PWM chatter.
float SERVO_DEADBAND = 1.0f;

// ================================================================
//                  AXIS ORIENTATION (runtime flags)
//
//  These fix the "wrong servo responds" bug without reflashing.
//  Changed via GCS buttons; persisted in EEPROM.
//
//  axisSwap:   false = pitch→pitchServo, roll→rollServo
//              true  = swap the two sensor axes
//  pitchSign:  +1 or -1  (invert if correction goes wrong direction)
//  rollSign:   +1 or -1
// ================================================================
bool  axisSwap  = false;
int   pitchSign = 1;
int   rollSign  = 1;

// ================================================================
//                      SYNCHRONISATION
// ================================================================
SemaphoreHandle_t   configMutex;                                // protects filter + PID config
static portMUX_TYPE imuLock = portMUX_INITIALIZER_UNLOCKED;    // protects 64-bit sensor angles

// ================================================================
//                        SENSOR ANGLES
//  Written by Core 1 exclusively, read by Core 0 for streaming.
//  64-bit doubles are not atomically read/written on Xtensa LX6,
//  so always use imuLock around every access.
// ================================================================
volatile double sensorPitch = 0.0;   // °, nose-up positive
volatile double sensorRoll  = 0.0;   // °, right-tilt positive
volatile double sensorYaw   = 0.0;   // °, gyro-integrated only

// Internal IMU working variables — Core 1 only, no lock needed
static double  gyrX = 0.0, gyrY = 0.0, gyrZ = 0.0;
static double  gyrXoffs = 0.0, gyrYoffs = 0.0, gyrZoffs = 0.0;
static int16_t accX = 0, accY = 0, accZ = 0;
static double  fax = 0.0, fay = 0.0, faz = 0.0;  // filtered accel
static double  fgx = 0.0, fgy = 0.0, fgz = 0.0;  // filtered gyro

// ================================================================
//                     STABILISATION STATE
// ================================================================
float referencePitch  = 0.0f;
float referenceRoll   = 0.0f;
float pitchOffset     = SERVO_CENTER;
float rollOffset      = SERVO_CENTER;
bool  lastAutoState   = false;

static int lastPitchCmd = SERVO_CENTER;   // last angle written to pitch servo
static int lastRollCmd  = SERVO_CENTER;   // last angle written to roll servo

// ================================================================
//                     PWM CACHE  (Core 1 → Core 0)
//  Core 1 reads PWM pulses and stores results here.
//  Core 0 reads these for streaming — no pulseIn on Core 0.
//  int is 32-bit aligned → atomic read on LX6, no lock needed.
// ================================================================
volatile int pwmPct1 = 50, pwmPct2 = 50, pwmPct3 = 50, pwmPct4 = 0;

// ================================================================
//                     STREAMING FLAGS
//  Written and read by Core 0 only inside the client loop.
//  No lock needed.
// ================================================================
volatile bool cubeStreaming = false;
volatile bool pwmStreaming  = false;

static unsigned long lastLoopTime = 0;

// ================================================================
//                         PID STRUCT
// ================================================================
struct PID {
  float Kp, Ki, Kd;
  float integral;
  float prevMeasurement;   // for derivative-on-measurement
  unsigned long lastTime;
  bool  justReset;         // skip bumpless transfer on first tick after reset
};

PID pitchPID = {2.0f, 0.1f, 0.5f, 0.0f, 0.0f, 0, true};
PID rollPID  = {2.0f, 0.1f, 0.5f, 0.0f, 0.0f, 0, true};

Servo pitchServo;
Servo rollServo;

// ================================================================
//                     FUNCTION PROTOTYPES
// ================================================================
void  loadParameters();
void  saveParametersUnlocked();
void  loadWifiCredentials();
void  saveWifiCredentials(const char* ssid, const char* pass);
void  checkSerialConfig();
void  initMPU6050();
void  calibrateMPU6050();
void  updateMPU6050();
void  getAngles(float& pitch, float& roll);
void  updateServoFromMPU();
void  writeServo(Servo& s, int& last, int angle);
float computePID(PID& pid, float setpoint, float meas, float curOut = 0.0f);
void  resetPID(PID& pid, float initMeas = 0.0f);
int   i2cRead(int addr, int reg, uint8_t* buf, int len);
int   i2cWrite(int addr, int reg, uint8_t val);
void  communicationTask(void* pv);

// ================================================================
//                  getAngles — AXIS MAPPING HELPER
//
//  Single place where axisSwap + pitchSign + rollSign are applied.
//  Every part of the code that needs the current angle calls this.
//  Never reads sensorPitch/sensorRoll directly.
// ================================================================
void getAngles(float& pitch, float& roll) {
  double sp, sr;
  portENTER_CRITICAL(&imuLock);
  sp = sensorPitch;
  sr = sensorRoll;
  portEXIT_CRITICAL(&imuLock);

