SoftwareEnthusiastArjun/ESP32_Based_FlightStabilizer/ESP32_FlightStabilizer_Firmware/src/main.cpp
  if (axisSwap) {
    pitch = (float)sr * pitchSign;
    roll  = (float)sp * rollSign;
  } else {
    pitch = (float)sp * pitchSign;
    roll  = (float)sr * rollSign;
  }
}

// ================================================================
//                  WIFI CREDENTIAL STORAGE
// ================================================================

// Load WiFi credentials from EEPROM into wifiSSID / wifiPass buffers.
// Falls back to compile-time defaults if no valid credentials are stored.
void loadWifiCredentials() {
  uint8_t magic = EEPROM.read(WIFI_VALID_ADDR);
  if (magic == WIFI_VALID_MAGIC) {
    // Read stored SSID
    for (int i = 0; i < WIFI_FIELD_LEN; i++) {
      wifiSSID[i] = (char)EEPROM.read(WIFI_SSID_ADDR + i);
    }
    wifiSSID[WIFI_FIELD_LEN - 1] = '\0';  // guarantee null terminator

    // Read stored password
    for (int i = 0; i < WIFI_FIELD_LEN; i++) {
      wifiPass[i] = (char)EEPROM.read(WIFI_PASS_ADDR + i);
    }
    wifiPass[WIFI_FIELD_LEN - 1] = '\0';

    // Sanity-check: SSID must be at least 1 char
    if (strlen(wifiSSID) == 0) {
      Serial.println("[WiFi] EEPROM credentials invalid, using defaults.");
      strncpy(wifiSSID, DEFAULT_WIFI_SSID, WIFI_FIELD_LEN - 1);
      strncpy(wifiPass, DEFAULT_WIFI_PASS, WIFI_FIELD_LEN - 1);
    } else {
      Serial.printf("[WiFi] Loaded SSID from EEPROM: %s\n", wifiSSID);
    }
  } else {
    Serial.println("[WiFi] No credentials in EEPROM, using defaults.");
    strncpy(wifiSSID, DEFAULT_WIFI_SSID, WIFI_FIELD_LEN - 1);
    strncpy(wifiPass, DEFAULT_WIFI_PASS, WIFI_FIELD_LEN - 1);
  }
}

// Persist WiFi credentials to EEPROM.
void saveWifiCredentials(const char* ssid, const char* pass) {
  EEPROM.write(WIFI_VALID_ADDR, WIFI_VALID_MAGIC);

  for (int i = 0; i < WIFI_FIELD_LEN; i++) {
    EEPROM.write(WIFI_SSID_ADDR + i, (i < (int)strlen(ssid)) ? ssid[i] : 0);
  }
  for (int i = 0; i < WIFI_FIELD_LEN; i++) {
    EEPROM.write(WIFI_PASS_ADDR + i, (i < (int)strlen(pass)) ? pass[i] : 0);
  }

  EEPROM.commit();
  Serial.println("[WiFi] Credentials saved to EEPROM.");
}

// ================================================================
//              SERIAL CONFIG MENU
//
//  Called once from setup() before WiFi connects.
//  Detects whether a serial terminal is open (DTR asserted) and, if
//  so, offers the user a short window to enter the config menu.
//  If no key is pressed within SERIAL_WAIT_MS, boot continues
//  normally with no delay or interaction.
//
//  Menu options:
//    1  — Change WiFi credentials (stored permanently in EEPROM)
//    2  — Show current WiFi SSID
//    3  — Clear stored credentials (revert to firmware defaults)
//    0  — Exit / continue boot
//
//  The function is entirely self-contained and does NOT modify any
//  flight-control state. It only reads/writes the WiFi sections of
//  EEPROM and the wifiSSID/wifiPass buffers.
// ================================================================
// ================================================================
//  SERIAL_WAIT_MS — how long the firmware waits for a keypress.
//
//  The GUI shows a 5-second countdown to the user, then sends the
//  choice byte.  The firmware window must be LONGER than the GUI
//  countdown so the choice always arrives in time even on slow PCs.
//  10 s gives comfortable headroom.
// ================================================================
#define SERIAL_WAIT_MS   10000  // ms to wait for keypress (> GUI 5 s countdown)
#define SERIAL_BAUD_WAIT 200    // ms to wait for USB-Serial bridge to enumerate

// ----------------------------------------------------------------
//  serialReadLine  — read one line from Serial
//
//  Blocks until '\n' arrives or timeoutMs elapses with no new char.
//  '\r' bytes are silently discarded (handles both LF and CRLF).
//  Returns true if at least one character was read.
// ----------------------------------------------------------------
static bool serialReadLine(char* buf, int maxLen, unsigned long timeoutMs) {
  int  idx      = 0;
  unsigned long deadline = millis() + timeoutMs;
  memset(buf, 0, maxLen);
  while (millis() < deadline) {
    if (Serial.available()) {
      char c = (char)Serial.read();
      if (c == '\r') continue;
      if (c == '\n' || c == '\0') break;
      if (idx < maxLen - 1) buf[idx++] = c;
      deadline = millis() + timeoutMs;  // reset timeout on every received char
    }
  }
  buf[idx] = '\0';
  return (idx > 0);
}

// ----------------------------------------------------------------
//  checkSerialConfig  — boot-time WiFi config menu
//
//  Called once from setup() before WiFi.begin().
//  Silently skipped when no serial terminal is connected.
//
//  The GUI serial monitor detects the "Flight Controller Config"
//  banner and shows the user two buttons within its own 5-second
//  countdown.  When the user clicks a button the GUI sends the
//  corresponding digit.  No human typing speed required.
//
//  Option 1 — Change WiFi credentials
//    GUI sends '1', then waits for each prompt line before sending
//    the value.  Firmware reads SSID, password, confirmation ('y').
//
//  Option 2 — View current SSID + password
//    GUI sends '2'.  Firmware prints credentials and immediately
//    continues boot — no blocking read needed, no Enter required.
//
//  Any other byte / timeout → boot normally.
// ----------------------------------------------------------------
void checkSerialConfig() {
  delay(SERIAL_BAUD_WAIT);
  if (!Serial) return;   // no USB-Serial connection — skip entirely

  // ---- Print banner (GUI watches for "Flight Controller Config") ----
  Serial.println();
  Serial.println("==============================");
  Serial.println("  Flight Controller Config");
  Serial.println("  Waiting for option (10 s)");
  Serial.println("==============================");
  Serial.println("  1 = Change WiFi credentials");
  Serial.println("  2 = View current SSID & password");
  Serial.println("  (timeout = boot normally)");
  Serial.println();

  // Flush any stale RX bytes that arrived before we started listening
  while (Serial.available()) Serial.read();

