SoftwareEnthusiastArjun/ESP32_Based_FlightStabilizer/ESP32_FlightStabilizer_Firmware/src/main.cpp
  // ---- Wait for one choice byte ----
  unsigned long deadline = millis() + SERIAL_WAIT_MS;
  char choice = 0;

  // Print a simple countdown once per second so the log shows activity
  int lastSecond = -1;
  while (millis() < deadline) {
    int remaining = (int)((deadline - millis()) / 1000) + 1;
    if (remaining != lastSecond) {
      Serial.printf("Booting in %d s...\n", remaining);
      lastSecond = remaining;
    }
    if (Serial.available()) {
      choice = (char)Serial.read();
      // Flush everything that arrived with the choice byte (e.g. the trailing
      // '\n' the GUI appends).  Without this flush, serialReadLine() reads the
      // '\n' immediately, sees zero real characters, returns false, and prints
      // "Timeout / empty input" before the user has typed anything.
      delay(10);
      while (Serial.available()) Serial.read();
      break;
    }
    delay(50);
  }

  if (choice == 0) {
    Serial.println("No input — booting normally.");
    return;
  }

  char inputBuf[WIFI_FIELD_LEN];

  switch (choice) {

    // ---- Option 1: Change WiFi credentials ----
    // GUI sends SSID line, password line, then 'y' to confirm.
    // Each serialReadLine() waits up to 30 s — plenty of time for
    // the user to edit fields in the GUI and press Send.
    case '1': {
      Serial.println("--- Change WiFi Credentials ---");
      Serial.println("Enter new SSID (then press Enter):");

      if (!serialReadLine(inputBuf, sizeof(inputBuf), 30000)) {
        Serial.println("Timeout / empty input. Credentials unchanged.");
        break;
      }
      char newSSID[WIFI_FIELD_LEN];
      strncpy(newSSID, inputBuf, WIFI_FIELD_LEN - 1);
      newSSID[WIFI_FIELD_LEN - 1] = '\0';

      Serial.println("Enter new Password (then press Enter):");
      serialReadLine(inputBuf, sizeof(inputBuf), 30000);  // blank = open network
      char newPass[WIFI_FIELD_LEN];
      strncpy(newPass, inputBuf, WIFI_FIELD_LEN - 1);
      newPass[WIFI_FIELD_LEN - 1] = '\0';

      Serial.printf("Confirm: SSID=\"%s\"  Password=\"%s\"\n", newSSID, newPass);
      Serial.println("Save? (y/n):");
      if (!serialReadLine(inputBuf, sizeof(inputBuf), 30000)) {
        Serial.println("Timeout. Credentials unchanged.");
        break;
      }
      if (inputBuf[0] == 'y' || inputBuf[0] == 'Y') {
        saveWifiCredentials(newSSID, newPass);
        strncpy(wifiSSID, newSSID, WIFI_FIELD_LEN - 1);
        strncpy(wifiPass, newPass, WIFI_FIELD_LEN - 1);
        Serial.println("Credentials saved. Continuing boot with new settings.");
      } else {
        Serial.println("Cancelled. Credentials unchanged.");
      }
      break;
    }

    // ---- Option 2: View current SSID & password ----
    // Just print and continue — no blocking read.
    // GUI button label: "1  View SSID" (sends '2' to firmware).
    case '2': {
      uint8_t magic = EEPROM.read(WIFI_VALID_ADDR);
      const char* src = (magic == WIFI_VALID_MAGIC) ? "EEPROM" : "firmware default";
      Serial.printf("Current SSID     (%s): %s\n", src, wifiSSID);
      Serial.printf("Current Password (%s): %s\n", src, wifiPass);
      // No blocking read — GUI does not send Enter for this option
      break;
    }

    default:
      Serial.println("Unrecognised option. Booting normally.");
      break;
  }

  Serial.println("Continuing boot...");
  Serial.println("==============================");
  delay(300);
}

// ================================================================
//                  PWM INPUT EDGE ISR  (Core 1)
//  One ISR shared by all 4 channels; index passed via attachInterruptArg.
//  IRAM_ATTR is MANDATORY — flash cache is disabled during EEPROM.commit()
//  and Wi-Fi flash ops; a non-IRAM ISR firing then crashes the chip with
//  "Cache disabled but cached memory region accessed".
//  micros() is backed by esp_timer_get_time() which is documented
//  ISR-safe (no critical sections, no flash access).
//  Reads GPIO level directly from the register — faster than digitalRead
//  and guaranteed IRAM-resident. All PWM pins (15/16/17/18) are < 32 so
//  GPIO.in is the correct register.
// ================================================================
void IRAM_ATTR pwmEdgeISR(void* arg) {
  uint32_t idx   = (uint32_t)arg;
  uint32_t now   = micros();
  uint32_t level = (GPIO.in >> PWM_PINS[idx]) & 0x1;
  if (level) {
    pulseRise[idx] = now;                       // rising edge → start of pulse
  } else {
    uint32_t w = now - pulseRise[idx];          // falling edge → pulse complete
    if (w < 3000UL) pulseWidth[idx] = w;        // sanity: ignore widths >3 ms
                                                // (real RC pulses ≤2 ms; guards against
                                                //  stale pulseRise if a rising edge was missed)
  }
  lastEdge[idx] = now;                          // any edge updates staleness timestamp
}

// ================================================================
//                           SETUP
// ================================================================
void setup() {
  Serial.begin(115200);
  delay(800);
  Serial.println("\n=== ESP32 Flight Controller ===");

  pinMode(LED_PIN, OUTPUT);
  digitalWrite(LED_PIN, LOW);

  // --- Synchronisation primitives ---
  configMutex = xSemaphoreCreateMutex();
  if (!configMutex) { Serial.println("FATAL: mutex"); while (true); }

  // --- Hardware ---
  EEPROM.begin(EEPROM_SIZE);
  Wire.begin(21, 22);
  Wire.setClock(400000);  // 400 kHz I2C — 4× faster than default

  // --- Load saved flight config ---
  loadParameters();

  // --- Load WiFi credentials from EEPROM (or use defaults) ---
  loadWifiCredentials();

  // --- Serial config menu (only active when a terminal is connected) ---
  // This must run before WiFi.begin() so any credential change takes effect.
  checkSerialConfig();

  // --- Sensor ---
  initMPU6050();
  calibrateMPU6050();

  // --- Reference attitude capture ---
  // Plane must be at rest and level here. This fixes the "home" attitude
  // used as the PID setpoint for the ENTIRE flight (not re-captured on
  // autopilot engagement). Warm up the complementary filter first so the
  // averaged reference isn't contaminated by the cold-start settle.
  Serial.println("Warming up IMU filter...");
  for (int i = 0; i < 40; i++) { // The one-sentence summary: the filter has memory that starts at zero, so it needs a running 
    updateMPU6050();             // start to converge on the real attitude — this loop gives it that head start during boot,
    delay(20);                   // where the blocking cost is free, so the aircraft never stabilizes against a wrong estimate.(40 × 20 ms = 800 ms to settle settle;)
  }
  Serial.println("Capturing reference attitude (keep still)...");
  {
    const int SAMPLES = 20;
    double sumP = 0.0, sumR = 0.0;
    for (int i = 0; i < SAMPLES; i++) {
      updateMPU6050();
      float tp, tr;
      getAngles(tp, tr);
      sumP += tp; sumR += tr;
      delay(20);
    }
    referencePitch = (float)(sumP / SAMPLES);
    referenceRoll  = (float)(sumR / SAMPLES);
  }
  Serial.printf("Reference captured: pitch=%.2f roll=%.2f\n",
                referencePitch, referenceRoll);

