SoftwareEnthusiastArjun/ESP32_Based_FlightStabilizer/ESP32_FlightStabilizer_Firmware/src/main.cpp
  // --- PWM inputs ---
  pinMode(PITCH_IP,    INPUT);
  pinMode(ROLL_IP,     INPUT);
  pinMode(YAW_IP,      INPUT);
  pinMode(AUTO_PILOT_IP, INPUT);

  // Attach ISRs for non-blocking PWM capture (replaces pulseIn in loop())
  for (uint32_t i = 0; i < 4; i++) {
    attachInterruptArg(digitalPinToInterrupt(PWM_PINS[i]),
                       pwmEdgeISR, (void*)i, CHANGE);
  }

  // --- Servos ---
  pitchServo.attach(PITCH_SERVO_PIN);
  rollServo.attach(ROLL_SERVO_PIN);
  pitchServo.write(SERVO_CENTER);
  rollServo.write(SERVO_CENTER);
  lastPitchCmd = SERVO_CENTER;
  lastRollCmd  = SERVO_CENTER;

  // --- Prime complementary filter (50 ticks = 1 s) ---
  Serial.println("Priming IMU...");
  for (int i = 0; i < 50; i++) { updateMPU6050(); delay(20); }

  float p, r;
  getAngles(p, r);
  Serial.printf("IMU ready. pitch=%.2f roll=%.2f\n", p, r);
  Serial.println("Tilt nose UP → pitch+, tilt RIGHT → roll+");
  Serial.println("If wrong: send swapAxes/invertPitch/invertRoll from GCS.");

  // --- WiFi (uses wifiSSID / wifiPass set above) ---
  WiFi.mode(WIFI_STA);
  WiFi.begin(wifiSSID, wifiPass);
  Serial.printf("WiFi connecting to \"%s\"", wifiSSID);
  unsigned long t0 = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - t0 < 10000) {
    Serial.print('.'); delay(500);
  }
  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\nIP: %s\n", WiFi.localIP().toString().c_str());
    if (MDNS.begin("esp32")) Serial.println("mDNS: esp32.local");
    tcpServer.begin();
    Serial.println("TCP server port 12345");
    xTaskCreatePinnedToCore(communicationTask, "GCS", 12000, NULL, 1, NULL, 0);
    Serial.println("GCS task → Core 0");
    digitalWrite(LED_PIN, HIGH);  // LED on = WiFi connected
  } else {
    Serial.println("\nWiFi failed. Flight-only mode.");
  }

  // --- Armed indicator: wiggle roll servo 3× so it's visible that
  //     setup is complete and the FC is about to enter the main loop ---
  Serial.println("Setup complete — arming indicator.");
  for (int i = 0; i < 3; i++) {
    rollServo.write(SERVO_CENTER - 25); delay(150);
    rollServo.write(SERVO_CENTER + 25); delay(150);
  }
  rollServo.write(SERVO_CENTER);   // return to neutral before loop starts
  lastRollCmd = SERVO_CENTER;
}

// ================================================================
//                      MAIN LOOP  (Core 1)
// ================================================================
void loop() {
  // Rate-limit to FREQ Hz without any blocking delay
  unsigned long now = millis();
  if (now - lastLoopTime < (unsigned long)(1000.0f / FREQ)) return;
  lastLoopTime = now;

  // 1. Update sensor — always, every tick
  updateMPU6050();

  // 2. Read PWM inputs — non-blocking, captured by pwmEdgeISR.
  //    If no edge has been seen for SIGNAL_TIMEOUT_US the channel is
  //    reported as 0 µs, matching the previous pulseIn timeout behavior
  //    (downstream: p4 == 0 → autopilot off, GCS shows "No signal").
  uint32_t now_us = micros();
  uint32_t pw1 = ((uint32_t)(now_us - lastEdge[0]) > SIGNAL_TIMEOUT_US) ? 0 : pulseWidth[0];
  uint32_t pw2 = ((uint32_t)(now_us - lastEdge[1]) > SIGNAL_TIMEOUT_US) ? 0 : pulseWidth[1];
  uint32_t pw3 = ((uint32_t)(now_us - lastEdge[2]) > SIGNAL_TIMEOUT_US) ? 0 : pulseWidth[2];
  uint32_t pw4 = ((uint32_t)(now_us - lastEdge[3]) > SIGNAL_TIMEOUT_US) ? 0 : pulseWidth[3];

  int p1 = constrain(map(pw1, MIN_PW, MAX_PW, 0, 100), 0, 100);
  int p2 = constrain(map(pw2, MIN_PW, MAX_PW, 0, 100), 0, 100);
  int p3 = constrain(map(pw3, MIN_PW, MAX_PW, 0, 100), 0, 100);
  int p4 = constrain(map(pw4, MIN_PW, MAX_PW, 0, 100), 0, 100);

  // Stick deadband — snap ±3% around centre to exactly 50
  if (abs(p1 - 50) < 3) p1 = 50;
  if (abs(p2 - 50) < 3) p2 = 50;
  if (abs(p3 - 50) < 3) p3 = 50;

  // Publish for Core 0 streaming (atomic 32-bit int writes)
  pwmPct1 = p1; pwmPct2 = p2; pwmPct3 = p3; pwmPct4 = p4;

  bool autoActive = (p4 > 90);

  // 3. Mode-transition edge detector
  if (autoActive != lastAutoState) {
    if (autoActive) {
      // Reference attitude is fixed at startup — do NOT re-capture here.
      // Only reset PID state so the handover into autopilot is bumpless.
      pitchOffset    = SERVO_CENTER;
      rollOffset     = SERVO_CENTER;

      float cp, cr;
      getAngles(cp, cr);
      resetPID(pitchPID, cp);
      resetPID(rollPID,  cr);

      Serial.printf("AUTO ON  ref: pitch=%.2f roll=%.2f\n",
                    referencePitch, referenceRoll);
    } else {
      Serial.println("AUTO OFF");
    }
    lastAutoState = autoActive;
  }

  // 4. Apply control
  if (autoActive) {
    bool pitchStickCentred = (abs(p2 - 50) <= 5);
    bool rollStickCentred  = (abs(p1 - 50) <= 5);

    if (pitchStickCentred && rollStickCentred) {
      // Both centred → full PID on both axes
      updateServoFromMPU();
    } else {
      float cp, cr;
      getAngles(cp, cr);

      if (rollStickCentred) {
        // PID on roll only
        float out = computePID(rollPID, referenceRoll, cr, lastRollCmd - rollOffset);
        writeServo(rollServo, lastRollCmd, (int)(rollOffset + out));
      } else {
        resetPID(rollPID, cr);
        writeServo(rollServo, lastRollCmd, map(p1, 0, 100, SERVO_MIN, SERVO_MAX));
      }

      if (pitchStickCentred) {
        // PID on pitch only
        float out = computePID(pitchPID, referencePitch, cp, lastPitchCmd - pitchOffset);
        writeServo(pitchServo, lastPitchCmd, (int)(pitchOffset + out));
      } else {
        resetPID(pitchPID, cp);
        writeServo(pitchServo, lastPitchCmd, map(p2, 0, 100, SERVO_MIN, SERVO_MAX));
      }
    }
  } else {
    // Full manual
    writeServo(rollServo,  lastRollCmd,  map(p1, 0, 100, SERVO_MIN, SERVO_MAX));
    writeServo(pitchServo, lastPitchCmd, map(p2, 0, 100, SERVO_MIN, SERVO_MAX));
  }
}

// ================================================================
//                  SERVO WRITE WITH DEADBAND
// ================================================================
void writeServo(Servo& s, int& last, int angle) {
  angle = constrain(angle, SERVO_MIN, SERVO_MAX);
  if (abs(angle - last) >= (int)SERVO_DEADBAND) {
    s.write(angle);
    last = angle;
  }
}

// ================================================================
//                      PID CONTROLLER
//
//  Derivative-on-measurement: takes d/dt of sensor reading, not error.
//  → Eliminates derivative kick from noise spikes.
//  Error deadband: errors < PID_DEADBAND are zeroed.
//  → Eliminates constant hunting from sensor noise at rest.
//  just_reset flag: skips bumpless transfer on first tick.
//  → Eliminates servo jump on mode switch.
// ================================================================
float computePID(PID& pid, float setpoint, float meas, float curOut) {
  unsigned long now = millis();
  float dt = (now - pid.lastTime) / 1000.0f;
  if (dt <= 0.0f) dt = 1.0f / FREQ;

  float error = setpoint - meas;
  if (fabsf(error) < PID_DEADBAND) error = 0.0f;

  // Bumpless transfer — skipped on first tick after reset
  if (!pid.justReset && pid.Ki != 0.0f) {
    float dM = (meas - pid.prevMeasurement) / dt;
    pid.integral = (curOut - pid.Kp * error + pid.Kd * dM) / pid.Ki;
  }
  pid.justReset = false;

  pid.integral += error * dt;
  pid.integral  = constrain(pid.integral, -50.0f, 50.0f);

  float deriv = -(meas - pid.prevMeasurement) / dt;  // derivative on measurement
  float output = pid.Kp * error + pid.Ki * pid.integral + pid.Kd * deriv;

  pid.prevMeasurement = meas;
  pid.lastTime = now;
  return output;
}

void resetPID(PID& pid, float initMeas) {
  pid.integral        = 0.0f;
  pid.prevMeasurement = initMeas;
  pid.lastTime        = millis();
  pid.justReset       = true;
}

// ================================================================
//                       SERVO CONTROL
// ================================================================
void updateServoFromMPU() {
  float cp, cr;
  getAngles(cp, cr);
  float po = computePID(pitchPID, referencePitch, cp, lastPitchCmd - pitchOffset);
  float ro = computePID(rollPID,  referenceRoll,  cr, lastRollCmd  - rollOffset);
  writeServo(pitchServo, lastPitchCmd, (int)(pitchOffset + po));
  writeServo(rollServo,  lastRollCmd,  (int)(rollOffset  + ro));
}

// ================================================================
//                      MPU6050 FUNCTIONS
// ================================================================
void initMPU6050() {
  Serial.println("Init MPU6050...");
  i2cWrite(MPU6050_ADDR, 0x6B, 0x00);  // wake
  i2cWrite(MPU6050_ADDR, 0x1A, 0x03);  // DLPF 44 Hz
  i2cWrite(MPU6050_ADDR, 0x1B, 0x08);  // gyro ±500°/s
  i2cWrite(MPU6050_ADDR, 0x1C, 0x08);  // accel ±4g
  i2cWrite(MPU6050_ADDR, 0x19, (uint8_t)((1000.0f / FREQ) - 1.0f));
}

void calibrateMPU6050() {
  Serial.println("Calibrating gyro (keep still)...");
  const int N = 500;
  long sx = 0, sy = 0, sz = 0; // use long to avoid overflow from summing 500 int16_t samples, sx etc are sums of raw gyro readings, not averages yet
  uint8_t d[6];
  for (int i = 0; i < N; i++) {
    if (i2cRead(MPU6050_ADDR, 0x43, d, 6) == 0) {
      sx += (int16_t)((d[0] << 8) | d[1]);
      sy += (int16_t)((d[2] << 8) | d[3]);
      sz += (int16_t)((d[4] << 8) | d[5]);
    }
    delay(2);
  }
  gyrXoffs = (double)sx / N;
  gyrYoffs = (double)sy / N;
  gyrZoffs = (double)sz / N;
  Serial.printf("Gyro offsets: X=%.1f Y=%.1f Z=%.1f\n", gyrXoffs, gyrYoffs, gyrZoffs);
}

void updateMPU6050() {
  static unsigned long prev = 0;
  unsigned long now = millis();
  float dt = (prev == 0) ? (1.0f / FREQ) : (now - prev) / 1000.0f;
  if (dt <= 0.0f) dt = 1.0f / FREQ;
  prev = now;

