SoftwareEnthusiastArjun/ESP32_Based_FlightStabilizer/ESP32_FlightStabilizer_Firmware/src/main.cpp
  uint8_t d[14];
  if (i2cRead(MPU6050_ADDR, 0x3B, d, 14) != 0) return;

  accX = (int16_t)((d[0]  << 8) | d[1]);
  accY = (int16_t)((d[2]  << 8) | d[3]);
  accZ = (int16_t)((d[4]  << 8) | d[5]);
  // d[6..7] = temp, skip. gyrX/Y/Z are °/s
  gyrX = ((int16_t)((d[8]  << 8) | d[9])  - gyrXoffs) / G_SENSITIVITY;
  gyrY = ((int16_t)((d[10] << 8) | d[11]) - gyrYoffs) / G_SENSITIVITY;
  gyrZ = ((int16_t)((d[12] << 8) | d[13]) - gyrZoffs) / G_SENSITIVITY; // G_SENSITIVITY is the sensor's conversion factor, set by the hardware:(take, 65.5 LSB = 1°/s for example, LSB = "Least Significant Bit" = one raw unit from the sensor.
  // So if the sensor outputs 1997: 1997 / 65.5 = 30.5°/s), but in reality 65.5 LSB/°/s == ±500°/s
  // Low-pass filter accel & gyro
  fax = fax * (1.0 - ACCEL_FILTER) + accX * ACCEL_FILTER;
  fay = fay * (1.0 - ACCEL_FILTER) + accY * ACCEL_FILTER;
  faz = faz * (1.0 - ACCEL_FILTER) + accZ * ACCEL_FILTER;
  fgx = fgx * (1.0 - GYRO_FILTER)  + gyrX * GYRO_FILTER;
  fgy = fgy * (1.0 - GYRO_FILTER)  + gyrY * GYRO_FILTER;
  fgz = fgz * (1.0 - GYRO_FILTER)  + gyrZ * GYRO_FILTER;

  // Accel angles — computed AFTER filter update (not one sample stale)
  // MPU6050 standard orientation (chip flat, dot top-left):
  //   X → RIGHT,  Y → FORWARD,  Z → UP
  // Pitch (nose up/down) uses accX component vs YZ plane
  // Roll  (left/right)   uses accY component vs XZ plane
  double accelPitch = atan2(fax, sqrt(fay * fay + faz * faz)) * 180.0 / M_PI;
  double accelRoll  = atan2(fay, sqrt(fax * fax + faz * faz)) * 180.0 / M_PI;

  // Gyro integration with actual dt, this tells us how much the angle has changed since the last update according to the gyro. The gyro gives us a rate of rotation, so we multiply by dt to get an angle change, and add that to our previous angle estimate (sensorPitch, sensorRoll, sensorYaw) to get a new angle estimate based on the gyro.
  double np = sensorPitch + fgy * dt;   // Y gyro → pitch rate
  double nr = sensorRoll  + fgx * dt;   // X gyro → roll rate
  double ny = sensorYaw   + fgz * dt;   // Z gyro → yaw rate

  // Complementary filter
  np = np * (1.0 - COMP_FILTER) + accelPitch * COMP_FILTER; //np is the new pitch estimate, which is a blend of the integrated gyro (np) and the accel angle (accelPitch), weighted by COMP_FILTER
  nr = nr * (1.0 - COMP_FILTER) + accelRoll  * COMP_FILTER;

  // Atomic write (spinlock protects 64-bit double writes)
  portENTER_CRITICAL(&imuLock);
  sensorPitch = np;
  sensorRoll  = nr;
  sensorYaw   = ny; //not used at all now
  portEXIT_CRITICAL(&imuLock);
}

// ================================================================
//                    GCS COMMUNICATION TASK  (Core 0)
//
//  Command reference (all terminated with \n):
//
//  READ:
//    get              → "AF,GF,CF\n"          filter values
//    getPitchPID      → "Kp,Ki,Kd\n"
//    getRollPID       → "Kp,Ki,Kd\n"
//    getStatus        → "pitch,roll,yaw,autoOn,axisSwap,pSign,rSign,pDB,sDB\n"
//
//  WRITE FILTERS:
//    setA{v}          → "OK\n"  ACCEL_FILTER
//    setG{v}          → "OK\n"  GYRO_FILTER
//    setC{v}          → "OK\n"  COMP_FILTER
//
//  WRITE PID:
//    setPitchP{v}     → "OK\n"
//    setPitchI{v}     → "OK\n"
//    setPitchD{v}     → "OK\n"
//    setRollP{v}      → "OK\n"
//    setRollI{v}      → "OK\n"
//    setRollD{v}      → "OK\n"
//
//  WRITE TUNING:
//    setPidDB{v}      → "OK,{v}\n"   PID deadband (degrees)
//    setServoDb{v}    → "OK,{v}\n"   servo deadband (degrees)
//
//  AXIS CONFIG:
//    swapAxes         → "OK,swap={0/1}\n"   toggle axisSwap
//    invertPitch      → "OK,pitchSign={1/-1}\n"
//    invertRoll       → "OK,rollSign={1/-1}\n"
//
//  ACTIONS:
//    calibrate        → "CAL_START\n" ... "CAL_DONE,X,Y,Z\n"
//    save             → "OK\n"
//
//  STREAMING:
//    startPWMStream   → "PWM_STREAM_START\n" then "{p1},{p2},{p3},{p4}\n" @ 5Hz
//    stopPWMStream    → "PWM_STREAM_STOPPED\n"
//    startCubeStream  → "CUBE_STREAM_START\n" then "{roll},{pitch},{yaw}\n" @ 50Hz
//    stopCubeStream   → "CUBE_STREAM_STOPPED\n"
// ================================================================
void communicationTask(void* pv) {
  for (;;) {
    WiFiClient client = tcpServer.available();
    if (!client) { vTaskDelay(pdMS_TO_TICKS(50)); continue; }

    Serial.println("[GCS] Client connected.");
    client.setTimeout(5);

    char    cmd[MAX_CMD_LEN + 1];
    char    resp[96];
    bool    streaming_pwm  = false;
    bool    streaming_cube = false;
    unsigned long lastSent = 0;

    while (client.connected()) {

      // --- Incoming command ---
      if (client.available()) {
        size_t n = client.readBytesUntil('\n', cmd, MAX_CMD_LEN);
        cmd[n] = '\0';
        if (n > 0 && cmd[n-1] == '\r') cmd[n-1] = '\0';
        Serial.printf("[GCS] %s\n", cmd);

        if (xSemaphoreTake(configMutex, pdMS_TO_TICKS(30)) == pdTRUE) {

          // ---- READ ----
          if (strcmp(cmd, "get") == 0) {
            snprintf(resp, sizeof(resp), "%.3f,%.3f,%.3f\n",
                     ACCEL_FILTER, GYRO_FILTER, COMP_FILTER);
            client.print(resp);

          } else if (strcmp(cmd, "getPitchPID") == 0) {
            snprintf(resp, sizeof(resp), "%.3f,%.3f,%.3f\n",
                     pitchPID.Kp, pitchPID.Ki, pitchPID.Kd);
            client.print(resp);

          } else if (strcmp(cmd, "getRollPID") == 0) {
            snprintf(resp, sizeof(resp), "%.3f,%.3f,%.3f\n",
                     rollPID.Kp, rollPID.Ki, rollPID.Kd);
            client.print(resp);

          } else if (strcmp(cmd, "getStatus") == 0) {
            double sp, sr, sy;
            portENTER_CRITICAL(&imuLock);
            sp = sensorPitch; sr = sensorRoll; sy = sensorYaw;
            portEXIT_CRITICAL(&imuLock);
            snprintf(resp, sizeof(resp),
                     "%.2f,%.2f,%.2f,%d,%d,%d,%d,%.2f,%.2f\n",
                     (float)sp, (float)sr, (float)sy,
                     (int)lastAutoState,
                     (int)axisSwap, pitchSign, rollSign,
                     PID_DEADBAND, SERVO_DEADBAND);
            client.print(resp);

          // ---- WRITE FILTERS ----
          } else if (strncmp(cmd, "setA", 4) == 0 && cmd[4] != '\0') {
            float v = atof(cmd + 4);
            if (v > 0.0f && v <= 1.0f) { ACCEL_FILTER = v; client.println("OK"); }
            else client.println("ERR:range");

          } else if (strncmp(cmd, "setG", 4) == 0 && cmd[4] != '\0') {
            float v = atof(cmd + 4);
            if (v > 0.0f && v <= 1.0f) { GYRO_FILTER = v; client.println("OK"); }
            else client.println("ERR:range");

          } else if (strncmp(cmd, "setC", 4) == 0 && cmd[4] != '\0') {
            float v = atof(cmd + 4);
            if (v > 0.0f && v <= 1.0f) { COMP_FILTER = v; client.println("OK"); }
            else client.println("ERR:range");

          // ---- WRITE PID ----
          } else if (strncmp(cmd, "setPitchP", 9) == 0 && cmd[9] != '\0') {
            float v = atof(cmd + 9);
            if (v >= 0.0f) { pitchPID.Kp = v; client.println("OK"); }
            else client.println("ERR:negative");

