SoftwareEnthusiastArjun/ESP32_Based_FlightStabilizer/ESP32_FlightStabilizer_Firmware/src/main.cpp
          } else if (strncmp(cmd, "setPitchI", 9) == 0 && cmd[9] != '\0') {
            float v = atof(cmd + 9);
            if (v >= 0.0f) { pitchPID.Ki = v; client.println("OK"); }
            else client.println("ERR:negative");

          } else if (strncmp(cmd, "setPitchD", 9) == 0 && cmd[9] != '\0') {
            float v = atof(cmd + 9);
            if (v >= 0.0f) { pitchPID.Kd = v; client.println("OK"); }
            else client.println("ERR:negative");

          } else if (strncmp(cmd, "setRollP", 8) == 0 && cmd[8] != '\0') {
            float v = atof(cmd + 8);
            if (v >= 0.0f) { rollPID.Kp = v; client.println("OK"); }
            else client.println("ERR:negative");

          } else if (strncmp(cmd, "setRollI", 8) == 0 && cmd[8] != '\0') {
            float v = atof(cmd + 8);
            if (v >= 0.0f) { rollPID.Ki = v; client.println("OK"); }
            else client.println("ERR:negative");

          } else if (strncmp(cmd, "setRollD", 8) == 0 && cmd[8] != '\0') {
            float v = atof(cmd + 8);
            if (v >= 0.0f) { rollPID.Kd = v; client.println("OK"); }
            else client.println("ERR:negative");

          // ---- WRITE TUNING ----
          } else if (strncmp(cmd, "setPidDB", 8) == 0 && cmd[8] != '\0') {
            float v = atof(cmd + 8);
            if (v >= 0.0f && v <= 10.0f) {
              PID_DEADBAND = v;
              snprintf(resp, sizeof(resp), "OK,%.2f\n", v);
              client.print(resp);
            } else client.println("ERR:range");

          } else if (strncmp(cmd, "setServoDb", 10) == 0 && cmd[10] != '\0') {
            float v = atof(cmd + 10);
            if (v >= 0.0f && v <= 10.0f) {
              SERVO_DEADBAND = v;
              snprintf(resp, sizeof(resp), "OK,%.2f\n", v);
              client.print(resp);
            } else client.println("ERR:range");

          // ---- AXIS CONFIG ----
          } else if (strcmp(cmd, "swapAxes") == 0) {
            axisSwap = !axisSwap;
            snprintf(resp, sizeof(resp), "OK,swap=%d\n", (int)axisSwap);
            client.print(resp);
            Serial.printf("Axis swap = %d\n", (int)axisSwap);

          } else if (strcmp(cmd, "invertPitch") == 0) {
            pitchSign = -pitchSign;
            snprintf(resp, sizeof(resp), "OK,pitchSign=%d\n", pitchSign);
            client.print(resp);
            Serial.printf("pitchSign = %d\n", pitchSign);

          } else if (strcmp(cmd, "invertRoll") == 0) {
            rollSign = -rollSign;
            snprintf(resp, sizeof(resp), "OK,rollSign=%d\n", rollSign);
            client.print(resp);
            Serial.printf("rollSign = %d\n", rollSign);

          // ---- CALIBRATE ----
          //  Re-runs gyro bias calibration. Board must be still.
          //  Returns offsets when done.
          } else if (strcmp(cmd, "calibrate") == 0) {
            client.println("CAL_START");
            xSemaphoreGive(configMutex);
            // Run calibration (takes ~1 s, releases mutex first)
            calibrateMPU6050();
            // Re-take mutex to send response
            if (xSemaphoreTake(configMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
              snprintf(resp, sizeof(resp), "CAL_DONE,%.1f,%.1f,%.1f\n",
                       gyrXoffs, gyrYoffs, gyrZoffs);
              client.print(resp);
            }
            // mutex given below at end of block — skip the Give at the end
            goto mutex_already_given;

          // ---- SAVE ----
          } else if (strcmp(cmd, "save") == 0) {
            saveParametersUnlocked();
            client.println("OK");

          // ---- STREAMING ----
          } else if (strcmp(cmd, "startPWMStream") == 0) {
            streaming_cube = false; streaming_pwm = true; lastSent = 0;
            client.println("PWM_STREAM_START");

          } else if (strcmp(cmd, "stopPWMStream") == 0) {
            streaming_pwm = false;
            client.println("PWM_STREAM_STOPPED");

          } else if (strcmp(cmd, "startCubeStream") == 0) {
            streaming_pwm = false; streaming_cube = true; lastSent = 0;
            client.println("CUBE_STREAM_START");

          } else if (strcmp(cmd, "stopCubeStream") == 0) {
            streaming_cube = false;
            client.println("CUBE_STREAM_STOPPED");

          } else {
            client.println("ERR:unknown");
          }

          xSemaphoreGive(configMutex);
          mutex_already_given:;
        } else {
          client.println("ERR:busy");
        }
      }

      // --- PWM streaming (5 Hz) ---
      if (streaming_pwm && millis() - lastSent >= 200) {
        int p1 = pwmPct1, p2 = pwmPct2, p3 = pwmPct3, p4 = pwmPct4;
        if (p4 == 0)
          client.println("No signal");
        else
          client.printf("%d,%d,%d,%d\n", p1, p2, p3, p4);
        lastSent = millis();
      }

      // --- IMU streaming (50 Hz) ---
      //  Format: roll,pitch,yaw  — matches cube_visualizer2.py which does:
      //    gx, gy, gz = data  →  self.ax, self.ay, self.az
      //    glRotatef(self.ay, 1,0,0)  = pitch
      //    glRotatef(self.az, 0,1,0)  = yaw
      //    glRotatef(-self.ax, 0,0,1) = roll
      //  So: first field → roll (ax), second → pitch (ay), third → yaw (az)
      if (streaming_cube && millis() - lastSent >= (unsigned long)(1000.0f / FREQ)) {
        double sp, sr, sy;
        portENTER_CRITICAL(&imuLock);
        sp = sensorPitch; sr = sensorRoll; sy = sensorYaw;
        portEXIT_CRITICAL(&imuLock);

        // Apply axis config for the visualizer too
        float vp, vr;
        if (axisSwap) { vp = (float)sr * pitchSign; vr = (float)sp * rollSign; }
        else          { vp = (float)sp * pitchSign; vr = (float)sr * rollSign; }

        client.printf("%.2f,%.2f,%.2f\n", vr, vp, (float)sy);
        lastSent = millis();
      }

      vTaskDelay(pdMS_TO_TICKS(1));
    }

    client.stop();
    streaming_pwm = false; streaming_cube = false;
    cubeStreaming  = false; pwmStreaming   = false;
    Serial.println("[GCS] Client disconnected.");
  }
}

// ================================================================
//                           EEPROM
// ================================================================
void loadParameters() {
  if (xSemaphoreTake(configMutex, portMAX_DELAY) != pdTRUE) return;

  EEPROM.get(ACCEL_FILTER_ADDR,  ACCEL_FILTER);
  EEPROM.get(GYRO_FILTER_ADDR,   GYRO_FILTER);
  EEPROM.get(COMP_FILTER_ADDR,   COMP_FILTER);
  EEPROM.get(PITCH_PID_ADDR,     pitchPID.Kp);
  EEPROM.get(PITCH_PID_ADDR + 4, pitchPID.Ki);
  EEPROM.get(PITCH_PID_ADDR + 8, pitchPID.Kd);
  EEPROM.get(ROLL_PID_ADDR,      rollPID.Kp);
  EEPROM.get(ROLL_PID_ADDR + 4,  rollPID.Ki);
  EEPROM.get(ROLL_PID_ADDR + 8,  rollPID.Kd);

  uint8_t axCfg = 0;
  EEPROM.get(AXIS_CONFIG_ADDR, axCfg);
  axisSwap  = (axCfg & 0x01) != 0;
  pitchSign = (axCfg & 0x02) ? -1 : 1;
  rollSign  = (axCfg & 0x04) ? -1 : 1;

  EEPROM.get(PID_DB_ADDR,   PID_DEADBAND);
  EEPROM.get(SERVO_DB_ADDR, SERVO_DEADBAND);

