SoftwareEnthusiastArjun/ESP32_Based_FlightStabilizer/ESP32_FlightStabilizer_Firmware/src/main.cpp
  // Validate — NaN happens on blank EEPROM
  if (isnan(ACCEL_FILTER) || ACCEL_FILTER <= 0.0f || ACCEL_FILTER > 1.0f) ACCEL_FILTER = 0.3f;
  if (isnan(GYRO_FILTER)  || GYRO_FILTER  <= 0.0f || GYRO_FILTER  > 1.0f) GYRO_FILTER  = 0.08f;
  if (isnan(COMP_FILTER)  || COMP_FILTER  <= 0.0f || COMP_FILTER  > 1.0f) COMP_FILTER  = 0.7f;
  if (isnan(pitchPID.Kp) || pitchPID.Kp < 0.0f) pitchPID.Kp = 2.0f;
  if (isnan(pitchPID.Ki) || pitchPID.Ki < 0.0f) pitchPID.Ki = 0.1f;
  if (isnan(pitchPID.Kd) || pitchPID.Kd < 0.0f) pitchPID.Kd = 0.5f;
  if (isnan(rollPID.Kp)  || rollPID.Kp  < 0.0f) rollPID.Kp  = 2.0f;
  if (isnan(rollPID.Ki)  || rollPID.Ki  < 0.0f) rollPID.Ki  = 0.1f;
  if (isnan(rollPID.Kd)  || rollPID.Kd  < 0.0f) rollPID.Kd  = 0.5f;
  if (isnan(PID_DEADBAND)   || PID_DEADBAND   < 0.0f) PID_DEADBAND   = 0.8f;
  if (isnan(SERVO_DEADBAND) || SERVO_DEADBAND < 0.0f) SERVO_DEADBAND = 1.0f;

  xSemaphoreGive(configMutex);
}

// Called while configMutex is ALREADY HELD — does not re-take it.
void saveParametersUnlocked() {
  EEPROM.put(ACCEL_FILTER_ADDR,  ACCEL_FILTER);
  EEPROM.put(GYRO_FILTER_ADDR,   GYRO_FILTER);
  EEPROM.put(COMP_FILTER_ADDR,   COMP_FILTER);
  EEPROM.put(PITCH_PID_ADDR,     pitchPID.Kp);
  EEPROM.put(PITCH_PID_ADDR + 4, pitchPID.Ki);
  EEPROM.put(PITCH_PID_ADDR + 8, pitchPID.Kd);
  EEPROM.put(ROLL_PID_ADDR,      rollPID.Kp);
  EEPROM.put(ROLL_PID_ADDR + 4,  rollPID.Ki);
  EEPROM.put(ROLL_PID_ADDR + 8,  rollPID.Kd);

  uint8_t axCfg = 0;
  if (axisSwap)    axCfg |= 0x01;
  if (pitchSign<0) axCfg |= 0x02;
  if (rollSign <0) axCfg |= 0x04;
  EEPROM.put(AXIS_CONFIG_ADDR, axCfg);
  EEPROM.put(PID_DB_ADDR,      PID_DEADBAND);
  EEPROM.put(SERVO_DB_ADDR,    SERVO_DEADBAND);

  EEPROM.commit();
  Serial.println("Parameters saved.");
}

// ================================================================
//                         I2C HELPERS
// ================================================================
int i2cRead(int addr, int reg, uint8_t* buf, int len) {
  Wire.beginTransmission(addr);
  Wire.write(reg);
  if (Wire.endTransmission(false) != 0) return -1;
  Wire.requestFrom((uint8_t)addr, (size_t)len, (bool)true);
  int i = 0;
  while (Wire.available() && i < len) buf[i++] = Wire.read();
  return (i == len) ? 0 : -1;
}

int i2cWrite(int addr, int reg, uint8_t val) {
  Wire.beginTransmission(addr);
  Wire.write(reg);
  Wire.write(val);
  return Wire.endTransmission(true);
}